app/controllers/galeries_controller.rb

SELECT * FROM `galeries`
---
  def index
    @galeries = Galery.all