app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new
    @user.login = params[:user][:email]
    password = Digest::SHA1.hexdigest("--#{Time.now.to_s}--#{@user.login}--")[0,6]
    @user.password = password
    @user.password_confirmation = password
    @user.email = params[:user][:email]

    success = @user && @user.save
    if success && @user.errors.empty?
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `status`, `email`) VALUES('', '4d35ad038cb2238bb7dd1d6373495f530efdf506', '2011-07-01 19:36:27', '8a402ff123728f857e259ac40ce18e6a70d1346b', NULL, '2011-07-01 19:36:27', NULL, 'adhitia.hidayat.saputra@gmail.com', 0, 'adhitia.hidayat.saputra@gmail.com')
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'adhitia.hidayat.saputra@gmail.com') LIMIT 1